import { SelectedMajor } from '@/store/universityStore';

export interface Preset {
  id: string;
  name: string;
  majors: SelectedMajor[];
}

export const presets: Preset[] = [
  {
    id: 'it-computer-tehran',
    name: 'فناوری اطلاعات و مهندسی کامپیوتر در تهران',
    majors: [
      {
        id: '22749',
        name: 'مهندسی فناوری اطلاعات',
        universityId: 'aut',
        universityName: 'دانشگاه صنعتی امیرکبیر',
        rank: 1,
        capacity: 15
      },
      {
        id: '22750',
        name: 'مهندسی فناوری اطلاعات(محل اجرای پروژه' +
            'پژوهشگاه آپا)',
        universityId: 'aut',
        universityName: 'دانشگاه صنعتی امیرکبیر',
        rank: 2,
        capacity: 2
      },
      {
        id: '22757',
        name: 'مهندسی فناوری اطلاعات - تجارت الکترونیکی',
        universityId: 'sbu',
        universityName: 'دانشگاه شهید بهشتی',
        rank: 3,
        capacity: 6
      },
      {
        id: '22758',
        name: 'مهندسی فناوری اطلاعات - تجارت الکترونیکی',
        universityId: 'aut',
        universityName: 'دانشگاه صنعتی امیرکبیر',
        rank: 4,
        capacity: 5
      },
      {
        id: '22759',
        name: 'مهندسی فناوری اطلاعات - تجارت الکترونیکی(محل اجرای پروژه' +
            'پژوهشگاه آپا -)',
        universityId: 'aut',
        universityName: 'دانشگاه صنعتی امیرکبیر',
        rank: 5,
        capacity: 2
      },
      {
        id: '22760',
        name: 'مهندسی فناوری اطلاعات - تجارت الکترونیکی',
        universityId: 'kntu',
        universityName: 'دانشگاه صنعتی خواجه نصیرالدین طوسی',
        rank: 6,
        capacity: 5
      },
      {
        id: '22761',
        name: 'مهندسی فناوری اطلاعات - تجارت الکترونیکی',
        universityId: 'iust',
        universityName: 'دانشگاه علم و صنعت ایران',
        rank: 7,
        capacity: 5
      },
      {
        id: '22762',
        name: 'مهندسی فناوری اطلاعات - تجارت الکترونیکی بورس شرکت انفورماتیک',
        universityId: 'iust',
        universityName: 'دانشگاه علم و صنعت ایران',
        rank: 8,
        capacity: 2
      },
      {
        id: '22765',
        name: 'مهندسی فناوری اطلاعات - مدیریت سیستم های اطلاعاتی',
        universityId: 'kharazmi',
        universityName: 'دانشگاه خوارزمی',
        rank: 8,
        capacity: 6
      },
      {
        id: '22770',
        name: 'مهندسی فناوری اطلاعات - مدیریت سیستم‌های اطلاعاتی',
        universityId: 'kntu',
        universityName: 'دانشگاه صنعتی خواجه نصیرالدین طوسی',
        rank: 9,
        capacity: 5
      },
      {
        id: '22771',
        name: 'مهندسی فناوری اطلاعات - سیستم‌های ITS',
        universityId: 'modares',
        universityName: 'دانشگاه تربیت مدرس',
        rank: 10,
        capacity: 7
      },
      {
        id: '22772',
        name: 'مهندسی فناوری اطلاعات - سامانه‌های شبکه‌ای',
        universityId: 'modares',
        universityName: 'دانشگاه تربیت مدرس',
        rank: 11,
        capacity: 7
      },
      {
        id: '22773',
        name: 'مهندسی فناوری اطلاعات - سامانه‌های شبکه‌ای',
        universityId: 'ut',
        universityName: 'دانشگاه تهران',
        rank: 12,
        capacity: 4
      },
      {
        id: '22777',
        name: 'مهندسی فناوری اطلاعات - سامانه‌های شبکه‌ای',
        universityId: 'kntu',
        universityName: 'دانشگاه صنعتی خواجه نصیرالدین طوسی',
        rank: 13,
        capacity: 4
      },
      {
        id: '22778',
        name: 'مهندسی فناوری اطلاعات - سیستم‌های چندرسانه‌ای',
        universityId: 'ut',
        universityName: 'دانشگاه تهران',
        rank: 14,
        capacity: 4
      },
      {
        id: '22780',
        name: 'مهندسی فناوری اطلاعات - سیستم‌های چندرسانه‌ای',
        universityId: 'sbu',
        universityName: 'دانشگاه شهید بهشتی',
        rank: 15,
        capacity: 5
      },
      {
        id: '22781',
        name: 'مهندسی فناوری اطلاعات - معماری سازمانی',
        universityId: 'sbu',
        universityName: 'دانشگاه شهید بهشتی',
        rank: 16,
        capacity: 9
      },
      {
        id: '22784',
        name: 'آموزش مهندسي',
        universityId: 'ut',
        universityName: 'دانشگاه تهران',
        rank: 17,
        capacity: 1
      },
      {
        id: '22790',
        name: 'مهندسي فنّاوری اطالعات گرايش تجارت' +
            'الکترونيکي شبانه نوبت دوم',
        universityId: 'kntu',
        universityName: 'دانشگاه صنعتي خواجه نصيرالدين طوسي ',
        rank: 18,
        capacity: 3
      },
      {
        id: '22791',
        name: 'مهندسي فنّاوری اطالعات گرايش تجارت' +
            'الکترونيکي نوبت دوم',
        universityId: 'iust',
        universityName: 'دانشگاه علم و صنعت',
        rank: 19,
        capacity: 2
      },
      {
        id: '22792',
        name: 'مهندسي فنّاوری اطالعات گرايش مديريت' +
            'سيستمهای اطالعاتي نوبت دوم',
        universityId: 'kharazmi',
        universityName: 'دانشگاه خوارزمي',
        rank: 20,
        capacity: 1
      },
      {
        id: '22794',
        name: 'مهندسي فنّاوری اطالعات گرايش مديريت' +
            'سيستمهای اطالعاتي نوبت دوم',
        universityId: 'kntu',
        universityName: 'دانشگاه صنعتي خواجه نصيرالدين طوسي',
        rank: 21,
        capacity: 3
      },
      {
        id: '22795',
        name: 'مهندسي فنّاوری اطالعات گرايش' +
            'سامانههای شبکهای نوبت دوم',
        universityId: 'ut',
        universityName: 'دانشگاه تهران',
        rank: 22,
        capacity: 2
      },
      {
        id: '22796',
        name: 'مهندسي فنّاوری اطالعات گرايش' +
            'سامانههای شبکهای نوبت دوم',
        universityId: 'kntu',
        universityName: 'دانشگاه صنعتی خواجه نصیرالدین طوسی',
        rank: 23,
        capacity: 3
      },{
        "id": "۲۲۷۹۷",
        "name": "مهندسی فناوری اطلاعات گرایش سیستم های چند رسانه ای محل تحصیل دانشکده علوم و فنون نوین نوبت دوم",
        "universityId": "ut",
        "universityName": "دانشگاه تهران",
        "rank": 1,
        "capacity": 2
      },
      {
        "id": "۲۲۷۹۸",
        "name": "مهندسی فناوری اطلاعات گرایش سیستم های چند رسانه ای نوبت دوم",
        "universityId": "sbu",
        "universityName": "دانشگاه شهید بهشتی - تهران",
        "rank": 2,
        "capacity": 1
      },
      {
        "id": "۲۲۸۵۱",
        "name": "مهندسی فناوری اطلاعات پزشکی محل تحصیل دانشکده علوم و فنون نوین روزانه",
        "universityId": "ut",
        "universityName": "دانشگاه تهران",
        "rank": 1,
        "capacity": 4
      },
      {
        "id": "۲۲۸۵۲",
        "name": "مهندسی فناوری اطلاعات پزشکی محل تحصیل دانشکده علوم و فنون نوین نوبت دوم",
        "universityId": "ut",
        "universityName": "دانشگاه تهران",
        "rank": 2,
        "capacity": 1
      },
      {
        "id": "۲۲۸۵۷",
        "name": "مهندسی و علم کامپیوتر گرایش شبکه های کامپیوتری روزانه",
        "universityId": "ut",
        "universityName": "دانشگاه تهران",
        "rank": 1,
        "capacity": 3
      },
      {
        "id": "۲۲۸۵۸",
        "name": "مهندسی و علم کامپیوتر گرایش شبکه های کامپیوتری مصاحبه دارد - شرایط در پیوست شماره یک - فقط مرد روزانه",
        "universityId": "eisu",
        "universityName": "دانشگاه جامع انقلاب اسلامی - تهران",
        "rank": 2,
        "capacity": 8
      },
      {
        "id": "۲۲۸۵۹",
        "name": "مهندسی و علم کامپیوتر گرایش شبکه های کامپیوتری مصاحبه دارد - شرایط در پیوست شماره یک - فقط زن روزانه",
        "universityId": "eisu",
        "universityName": "دانشگاه جامع انقلاب اسلامی - تهران",
        "rank": 1,
        "capacity": 8
      },
      {
        "id": "۲۲۸۶۳",
        "name": "مهندسی و علم کامپیوتر گرایش شبکه های کامپیوتری روزانه",
        "universityId": "aut",
        "universityName": "دانشگاه صنعتی امیرکبیر - تهران",
        "rank": 2,
        "capacity": 5
      },
      {
        "id": "۲۲۸۶۴",
        "name": "مهندسی و علم کامپیوتر گرایش شبکه های کامپیوتری روزانه",
        "universityId": "kntu",
        "universityName": "دانشگاه صنعتی خواجه نصیرالدین طوسی - تهران",
        "rank": 3,
        "capacity": 7
      },
      {
        "id": "۲۲۸۶۵",
        "name": "مهندسی و علم کامپیوتر گرایش شبکه های کامپیوتری بورس شرکت ملی انفورماتیک - مصاحبه دارد - شرایط در پیوست شماره یک روزانه",
        "universityId": "kntu",
        "universityName": "دانشگاه صنعتی خواجه نصیرالدین طوسی - تهران",
        "rank": 4,
        "capacity": 2
      },
      {
        "id": "۲۲۸۶۷",
        "name": "مهندسی و علم کامپیوتر گرایش شبکه های کامپیوتری بورس شرکت رایانش ابری واحد روزانه",
        "universityId": "sut",
        "universityName": "دانشگاه صنعتی شریف - تهران",
        "rank": 5,
        "capacity": 5
      },
      {
        "id": "۲۲۸۶۸",
        "name": "مهندسی و علم کامپیوتر گرایش شبکه های کامپیوتری هزاردستان(ستون) - مصاحبه دارد - شرایط در پیوست شماره یک روزانه",
        "universityId": "sut",
        "universityName": "دانشگاه صنعتی شریف - تهران",
        "rank": 6,
        "capacity": 1
      },
      {
        "id": "۲۲۸۷۰",
        "name": "مهندسی و علم کامپیوتر گرایش شبکه های کامپیوتری روزانه",
        "universityId": "iust",
        "universityName": "دانشگاه علم و صنعت ایران - تهران",
        "rank": 7,
        "capacity": 11
      },
      {
        "id": "۲۲۸۷۱",
        "name": "مهندسی و علم کامپیوتر گرایش شبکه های کامپیوتری بورس شرکت ملی انفورماتیک - مصاحبه دارد - شرایط در پیوست شماره یک روزانه",
        "universityId": "iust",
        "universityName": "دانشگاه علم و صنعت ایران - تهران",
        "rank": 1,
        "capacity": 2
      },
      {
        "id": "۲۲۸۷۶",
        "name": "مهندسی و علم کامپیوتر گرایش شبکه های کامپیوتری مصاحبه دارد - شرایط در پیوست شماره یک - فقط مرد روزانه",
        "universityId": "ihu",
        "universityName": "دانشگاه جامع امام حسین (ع) - تهران",
        "rank": 2,
        "capacity": 8
      },
      {
        "id": "۲۲۸۷۹",
        "name": "مهندسی و علم کامپیوتر گرایش رایانش امن روزانه",
        "universityId": "tmu",
        "universityName": "دانشگاه تربیت مدرس - تهران",
        "rank": 1,
        "capacity": 6
      },
      {
        "id": "۲۲۸۸۰",
        "name": "مهندسی و علم کامپیوتر گرایش رایانش امن مصاحبه دارد - شرایط در پیوست شماره یک - فقط مرد روزانه",
        "universityId": "eisu",
        "universityName": "دانشگاه جامع انقلاب اسلامی - تهران",
        "rank": 2,
        "capacity": 10
      },
      {
        "id": "۲۲۸۸۱",
        "name": "مهندسی و علم کامپیوتر گرایش رایانش امن مصاحبه دارد - شرایط در پیوست شماره یک روزانه",
        "universityId": "shahed",
        "universityName": "دانشگاه شاهد - تهران",
        "rank": 3,
        "capacity": 12
      },
      {
        "id": "۲۲۸۸۲",
        "name": "مهندسی و علم کامپیوتر گرایش رایانش امن روزانه",
        "universityId": "sbu",
        "universityName": "دانشگاه شهید بهشتی - تهران",
        "rank": 4,
        "capacity": 8
      },
      {
        "id": "۲۲۸۸۵",
        "name": "مهندسی و علم کامپیوتر گرایش رایانش امن روزانه",
        "universityId": "aut",
        "universityName": "دانشگاه صنعتی امیرکبیر - تهران",
        "rank": 5,
        "capacity": 6
      },
      {
        "id": "۲۲۸۸۶",
        "name": "مهندسی و علم کامپیوتر گرایش رایانش امن بورس شرکت رایانش ابری واحد روزانه",
        "universityId": "sut",
        "universityName": "دانشگاه صنعتی شریف - تهران",
        "rank": 6,
        "capacity": 8
      },
      {
        "id": "۲۲۸۸۷",
        "name": "مهندسی و علم کامپیوتر گرایش رایانش امن هزاردستان(ستون) - مصاحبه دارد - شرایط در پیوست شماره یک روزانه",
        "universityId": "sut",
        "universityName": "دانشگاه صنعتی شریف - تهران",
        "rank": 7,
        "capacity": 1
      },
      {
        "id": "۲۲۸۸۸",
        "name": "مهندسی و علم کامپیوتر گرایش رایانش امن مصاحبه دارد - شرایط در پیوست شماره یک - فقط مرد روزانه",
        "universityId": "ihu",
        "universityName": "دانشگاه جامع امام حسین (ع) - تهران",
        "rank": 8,
        "capacity": 11
      },
      {
        "id": "۲۲۸۸۹",
        "name": "مهندسی و علم کامپیوتر گرایش رایانش امن محل تحصیل تهران - مصاحبه دارد - شرایط در پیوست شماره یک روزانه",
        "universityId": "mut",
        "universityName": "دانشگاه صنعتی مالک اشتر",
        "rank": 9,
        "capacity": 8
      },
      {
        "id": "۲۲۸۹۱",
        "name": "علوم و فناوری شبکه محل تحصیل دانشکده علوم و فنون نوین روزانه",
        "universityId": "ut",
        "universityName": "دانشگاه تهران",
        "rank": 10,
        "capacity": 4
      },
      {
        "id": "۲۲۸۹۲",
        "name": "جرم یابی دیجیتال روزانه",
        "universityId": "tmu",
        "universityName": "دانشگاه تربیت مدرس - تهران",
        "rank": 11,
        "capacity": 6
      },
      {
        "id": "۲۲۸۹۷",
        "name": "مهندسی و علم کامپیوتر گرایش شبکه های کامپیوتری نوبت دوم",
        "universityId": "ut",
        "universityName": "دانشگاه تهران",
        "rank": 1,
        "capacity": 2
      },
      {
        "id": "۲۲۸۹۸",
        "name": "مهندسی و علم کامپیوتر گرایش شبکه های کامپیوتری عدم تعهد در واگذاری خوابگاه نوبت دوم",
        "universityId": "kntu",
        "universityName": "دانشگاه صنعتی خواجه نصیرالدین طوسی - تهران",
        "rank": 2,
        "capacity": 6
      },
      {
        "id": "۲۲۹۰۴",
        "name": "مهندسی و علم کامپیوتر گرایش رایانش امن مصاحبه دارد - شرایط در پیوست شماره یک نوبت دوم",
        "universityId": "shahed",
        "universityName": "دانشگاه شاهد - تهران",
        "rank": 3,
        "capacity": 2
      },
      {
        "id": "۲۲۹۰۶",
        "name": "مهندسی و علم کامپیوتر گرایش رایانش امن محل تحصیل تهران - مصاحبه دارد - شرایط در پیوست شماره یک نوبت دوم",
        "universityId": "mut",
        "universityName": "دانشگاه صنعتی مالک اشتر",
        "rank": 1,
        "capacity": 8
      },
      {
        "id": "۲۲۹۰۷",
        "name": "علوم و فناوری شبکه محل تحصیل دانشکده علوم و فنون نوین نوبت دوم",
        "universityId": "ut",
        "universityName": "دانشگاه تهران",
        "rank": 2,
        "capacity": 2
      },
      {
        "id": "۲۲۹۶۰",
        "name": "مهندسی و علم کامپیوتر گرایش هوش مصنوعی روزانه",
        "universityId": "tmu",
        "universityName": "دانشگاه تربیت مدرس - تهران",
        "rank": 2,
        "capacity": 6
      },
      {
        "id": "۲۲۹۶۱",
        "name": "مهندسی و علم کامپیوتر گرایش هوش مصنوعی روزانه",
        "universityId": "ut",
        "universityName": "دانشگاه تهران",
        "rank": 3,
        "capacity": 20
      },
      {
        "id": "۲۲۹۶۳",
        "name": "مهندسی و علم کامپیوتر گرایش هوش مصنوعی محل تحصیل پردیس دانشکده های فنی - بورس شرکت ارتباطات سیار ایران(همراه اول) - مصاحبه دارد - شرایط در پیوست شماره یک روزانه",
        "universityId": "ut",
        "universityName": "دانشگاه تهران",
        "rank": 5,
        "capacity": 5
      },
      {
        "id": "۲۲۹۶۵",
        "name": "مهندسی و علم کامپیوتر گرایش هوش مصنوعی مصاحبه دارد - شرایط در پیوست شماره یک - فقط مرد روزانه",
        "universityId": "eisu",
        "universityName": "دانشگاه جامع انقلاب اسلامی - تهران",
        "rank": 7,
        "capacity": 8
      },
      {
        "id": "22974",
        "name": "مهندسی و علم کامپیوتر گرایش هوش مصنوعی",
        "universityId": "sbu",
        "universityName": "دانشگاه شهید بهشتی",
        "rank": 1,
        "capacity": 14
      },
      {
        "id": "۲۲۹۷۹",
        "name": "مهندسی و علم کامپیوتر گرایش هوش مصنوعی بورس شرکت گروه فناوری ارتباطات و اطلاعات شاتل - مصاحبه دارد - شرایط در پیوست شماره یک روزانه",
        "universityId": "aut",
        "universityName": "دانشگاه صنعتی امیرکبیر - تهران",
        "rank": 1,
        "capacity": 16
      },
      {
        "id": "۲۲۹۸۰",
        "name": "مهندسی و علم کامپیوتر گرایش هوش مصنوعی بورس شرکت ارتباطات سیار ایران(همراه اول) - مصاحبه دارد - شرایط در پیوست شماره یک روزانه",
        "universityId": "aut",
        "universityName": "دانشگاه صنعتی امیرکبیر - تهران",
        "rank": 2,
        "capacity": 3
      },
      {
        "id": "۲۲۹۸۱",
        "name": "مهندسی و علم کامپیوتر گرایش هوش مصنوعی بورس شرکت نوآوران داده سلامت پیشرو - مصاحبه دارد - شرایط در پیوست شماره یک روزانه",
        "universityId": "aut",
        "universityName": "دانشگاه صنعتی امیرکبیر - تهران",
        "rank": 3,
        "capacity": 3
      },
      {
        "id": "۲۶۳۹۴",
        "name": "مهندسی و علم کامپیوتر گرایش هوش مصنوعی روزانه",
        "universityId": "aut",
        "universityName": "دانشگاه صنعتی امیرکبیر - تهران",
        "rank": 4,
        "capacity": 2
      },
      {
        "id": "۲۲۹۸۲",
        "name": "مهندسی و علم کامپیوتر گرایش هوش مصنوعی بورس شرکت ملی انفورماتیک - مصاحبه دارد - شرایط در پیوست شماره یک روزانه",
        "universityId": "kntu",
        "universityName": "دانشگاه صنعتی خواجه نصیرالدین طوسی - تهران",
        "rank": 5,
        "capacity": 7
      },
      {
        "id": "۲۲۹۸۳",
        "name": "مهندسی و علم کامپیوتر گرایش هوش مصنوعی روزانه",
        "universityId": "kntu",
        "universityName": "دانشگاه صنعتی خواجه نصیرالدین طوسی - تهران",
        "rank": 6,
        "capacity": 2
      },
      {
        "id": "۲۲۹۸۶",
        "name": "مهندسی و علم کامپیوتر گرایش هوش مصنوعی روزانه",
        "universityId": "sut",
        "universityName": "دانشگاه صنعتی شریف - تهران",
        "rank": 7,
        "capacity": 20
      },
      {
        "id": "۲۲۹۹۰",
        "name": "مهندسی و علم کامپیوتر گرایش هوش مصنوعی بورس شرکت ملی انفورماتیک - مصاحبه دارد - شرایط در پیوست شماره یک روزانه",
        "universityId": "iust",
        "universityName": "دانشگاه علم و صنعت ایران - تهران",
        "rank": 8,
        "capacity": 16
      },
      {
        "id": "۲۲۹۹۲",
        "name": "مهندسی و علم کامپیوتر گرایش هوش مصنوعی بورس بیمه سامان - مصاحبه دارد - شرایط در پیوست شماره یک روزانه",
        "universityId": "iust",
        "universityName": "دانشگاه علم و صنعت ایران - تهران",
        "rank": 9,
        "capacity": 2
      },
      {
        "id": "۲۲۹۹۱",
        "name": "مهندسی و علم کامپیوتر گرایش هوش مصنوعی بورس شرکت نوآوران داده سلامت پیشرو - مصاحبه دارد - شرایط در پیوست شماره یک روزانه",
        "universityId": "iust",
        "universityName": "دانشگاه علم و صنعت ایران - تهران",
        "rank": 10,
        "capacity": 2
      },
      {
        "id": "۲۶۳۹۱",
        "name": "مهندسی و علم کامپیوتر گرایش هوش مصنوعی روزانه",
        "universityId": "iust",
        "universityName": "دانشگاه علم و صنعت ایران - تهران",
        "rank": 11,
        "capacity": 2
      },
      {
        "id": "۲۳۰۲۲",
        "name": "مهندسی و علم کامپیوتر گرایش هوش مصنوعی نوبت دوم",
        "universityId": "ut",
        "universityName": "دانشگاه تهران",
        "rank": 1,
        "capacity": 10
      },
      {
        "id": "۲۳۰۲۸",
        "name": "مهندسی و علم کامپیوتر گرایش هوش مصنوعی عدم تعهد در واگذاری خوابگاه نوبت دوم",
        "universityId": "kntu",
        "universityName": "دانشگاه صنعتی خواجه نصیرالدین طوسی - تهران",
        "rank": 3,
        "capacity": 5
      },
      {
        "id": "۲۳۱۰۲",
        "name": "مهندسی و علم کامپیوتر گرایش معماری سیستم‌های کامپیوتری روزانه",
        "universityId": "tmu",
        "universityName": "دانشگاه تربیت مدرس - تهران",
        "rank": 1,
        "capacity": 6
      },
      {
        "id": "۲۳۱۰۳",
        "name": "مهندسی و علم کامپیوتر گرایش معماری سیستم‌های کامپیوتری روزانه",
        "universityId": "ut",
        "universityName": "دانشگاه تهران",
        "rank": 2,
        "capacity": 8
      },
      {
        "id": "۲۳۱۰۶",
        "name": "مهندسی و علم کامپیوتر گرایش معماری سیستم‌های کامپیوتری مصاحبه دارد - شرایط در پیوست شماره یک روزانه",
        "universityId": "shahed",
        "universityName": "دانشگاه شاهد - تهران",
        "rank": 3,
        "capacity": 16
      },
      {
        "id": "۲۳۱۰۸",
        "name": "مهندسی و علم کامپیوتر گرایش معماری سیستم‌های کامپیوتری روزانه",
        "universityId": "sbu",
        "universityName": "دانشگاه شهید بهشتی - تهران",
        "rank": 4,
        "capacity": 12
      },
      {
        "id": "۲۳۱۱۲",
        "name": "مهندسی و علم کامپیوتر گرایش معماری سیستم‌های کامپیوتری روزانه",
        "universityId": "aut",
        "universityName": "دانشگاه صنعتی امیرکبیر - تهران",
        "rank": 5,
        "capacity": 11
      },
      {
        "id": "۲۳۱۱۴",
        "name": "مهندسی و علم کامپیوتر گرایش معماری سیستم‌های کامپیوتری روزانه",
        "universityId": "kntu",
        "universityName": "دانشگاه صنعتی خواجه نصیرالدین طوسی - تهران",
        "rank": 7,
        "capacity": 6
      },
      {
        "id": "۲۳۱۱۵",
        "name": "مهندسی و علم کامپیوتر گرایش معماری سیستم‌های کامپیوتری بورس شرکت رایانش ابری واحد روزانه",
        "universityId": "sut",
        "universityName": "دانشگاه صنعتی شریف - تهران",
        "rank": 8,
        "capacity": 16
      },
      {
        "id": "۲۳۱۱۶",
        "name": "مهندسی و علم کامپیوتر گرایش معماری سیستم‌های کامپیوتری هزاردستان(ستون) - مصاحبه دارد - شرایط در پیوست شماره یک روزانه",
        "universityId": "sut",
        "universityName": "دانشگاه صنعتی شریف - تهران",
        "rank": 9,
        "capacity": 1
      },
      {
        "id": "۲۳۱۱۸",
        "name": "مهندسی و علم کامپیوتر گرایش معماری سیستم‌های کامپیوتری روزانه",
        "universityId": "iust",
        "universityName": "دانشگاه علم و صنعت ایران - تهران",
        "rank": 10,
        "capacity": 7
      },
      {
        "id": "۲۳۱۲۸",
        "name": "مهندسی و علم کامپیوتر گرایش معماری سیستم‌های کامپیوتری نوبت دوم",
        "universityId": "ut",
        "universityName": "دانشگاه تهران",
        "rank": 1,
        "capacity": 4
      },
      {
        "id": "۲۳۱۲۹",
        "name": "مهندسی و علم کامپیوتر گرایش معماری سیستم‌های کامپیوتری مصاحبه دارد - شرایط در پیوست شماره یک نوبت دوم",
        "universityId": "shahed",
        "universityName": "دانشگاه شاهد - تهران",
        "rank": 2,
        "capacity": 2
      },
      {
        "id": "۲۳۱۳۱",
        "name": "مهندسی و علم کامپیوتر گرایش معماری سیستم‌های کامپیوتری عدم تعهد در واگذاری خوابگاه نوبت دوم",
        "universityId": "kntu",
        "universityName": "دانشگاه صنعتی خواجه نصیرالدین طوسی - تهران",
        "rank": 3,
        "capacity": 5
      },
      {
        "id": "۲۳۱۶۳",
        "name": "مهندسی و علم کامپیوتر گرایش نرم افزار روزانه",
        "universityId": "tmu",
        "universityName": "دانشگاه تربیت مدرس - تهران",
        "rank": 1,
        "capacity": 6
      },
      {
        "id": "۲۳۱۶۴",
        "name": "مهندسی و علم کامپیوتر گرایش نرم افزار روزانه",
        "universityId": "ut",
        "universityName": "دانشگاه تهران",
        "rank": 2,
        "capacity": 16
      },
      {
        "id": "۲۳۱۶۵",
        "name": "مهندسی و علم کامپیوتر گرایش نرم افزار محل تحصیل پردیس دانشکده های فنی - بورس شرکت ارتباطات سیار ایران(همراه اول) - مصاحبه دارد - شرایط در پیوست شماره یک روزانه",
        "universityId": "ut",
        "universityName": "دانشگاه تهران",
        "rank": 3,
        "capacity": 5
      },
      {
        "id": "23172",
        "name": "مهندسی و علم کامپیوتر گرایش نرم افزار",
        "universityId": "sbu",
        "universityName": "دانشگاه شهید بهشتی - تهران",
        "rank": 4,
        "capacity": 12
      },
      {
        "id": "۲۳۱۷۶",
        "name": "مهندسی و علم کامپیوتر گرایش نرم افزار بورس شرکت ارتباطات سیار ایران(همراه اول) - مصاحبه دارد - شرایط در پیوست شماره یک روزانه",
        "universityId": "aut",
        "universityName": "دانشگاه صنعتی امیرکبیر - تهران",
        "rank": 1,
        "capacity": 14
      },
      {
        "id": "۲۳۱۷۷",
        "name": "مهندسی و علم کامپیوتر گرایش نرم افزار بورس شرکت نوآوران داده سلامت پیشرو - مصاحبه دارد - شرایط در پیوست شماره یک روزانه",
        "universityId": "aut",
        "universityName": "دانشگاه صنعتی امیرکبیر - تهران",
        "rank": 2,
        "capacity": 3
      },
      {
        "id": "۲۶۳۹۵",
        "name": "مهندسی و علم کامپیوتر گرایش نرم افزار روزانه",
        "universityId": "aut",
        "universityName": "دانشگاه صنعتی امیرکبیر - تهران",
        "rank": 3,
        "capacity": 2
      },
      {
        "id": "۲۳۱۷۹",
        "name": "مهندسی و علم کامپیوتر گرایش نرم افزار  روزانه",
        "universityId": "kntu",
        "universityName": "دانشگاه صنعتی خواجه نصیرالدین طوسی - تهران",
        "rank": 4,
        "capacity": 6
      },
      {
        "id": "۲۳۱۸۰",
        "name": "مهندسی و علم کامپیوتر گرایش نرم افزار بورس شرکت ملی انفورماتیک - مصاحبه دارد - شرایط در پیوست شماره یک روزانه",
        "universityId": "kntu",
        "universityName": "دانشگاه صنعتی خواجه نصیرالدین طوسی - تهران",
        "rank": 5,
        "capacity": 3
      },
      {
        "id": "۲۳۱۸۲",
        "name": "مهندسی و علم کامپیوتر گرایش نرم افزار شرایط در پیوست شماره یک روزانه",
        "universityId": "sut",
        "universityName": "دانشگاه صنعتی شریف - تهران",
        "rank": 6,
        "capacity": 20
      },
      {
        "id": "۲۳۱۸۶",
        "name": "مهندسی و علم کامپیوتر گرایش نرم افزار روزانه",
        "universityId": "iust",
        "universityName": "دانشگاه علم و صنعت ایران - تهران",
        "rank": 7,
        "capacity": 20
      },
      {
        "id": "۲۳۱۸۷",
        "name": "مهندسی و علم کامپیوتر گرایش نرم افزار بورس شرکت ملی انفورماتیک - مصاحبه دارد - شرایط در پیوست شماره یک روزانه",
        "universityId": "iust",
        "universityName": "دانشگاه علم و صنعت ایران - تهران",
        "rank": 8,
        "capacity": 3
      },
      {
        "id": "۲۶۳۹۲",
        "name": "مهندسی و علم کامپیوتر گرایش نرم افزار بورس شرکت نوآوران داده سلامت پیشرو - مصاحبه دارد - شرایط در پیوست شماره یک روزانه",
        "universityId": "iust",
        "universityName": "دانشگاه علم و صنعت ایران - تهران",
        "rank": 9,
        "capacity": 2
      },
      {
        "id": "23205",
        "name": "مهندسی و علم کامپیوتر گرایش الگوریتم‌ها و محاسبات روزانه",
        "universityId": "ut",
        "universityName": "دانشگاه تهران",
        "rank": 4,
        "capacity": 20
      },
      {
        "id": "۲۳۲۰۶",
        "name": "مهندسی و علم کامپیوتر گرایش الگوریتم‌ها و محاسبات روزانه",
        "universityId": "sut",
        "universityName": "دانشگاه صنعتی شریف - تهران",
        "rank": 1,
        "capacity": 6
      },
      {
        "id": "۲۳۲۰۷",
        "name": "علم داده‌ها محل تحصیل دانشکده علوم و فناوری‌های بین رشته‌ای روزانه",
        "universityId": "tmu",
        "universityName": "دانشگاه تربیت مدرس - تهران",
        "rank": 2,
        "capacity": 2
      },
      {
        "id": "۲۳۲۰۸",
        "name": "علم داده‌ها روزانه",
        "universityId": "sbu",
        "universityName": "دانشگاه شهید بهشتی - تهران",
        "rank": 3,
        "capacity": 4
      },
      {
        "id": "۲۳۲۱۰",
        "name": "آموزش مهندسی محل تحصیل پردیس دانشکده‌های فنی - دانشکده علوم مهندسی روزانه",
        "universityId": "ut",
        "universityName": "دانشگاه تهران",
        "rank": 4,
        "capacity": 1
      },
      {
        "id": "۲۳۲۱۲",
        "name": "مهندسی کامپیوتر گرایش بیوانفورماتیک روزانه",
        "universityId": "sut",
        "universityName": "دانشگاه صنعتی شریف - تهران",
        "rank": 5,
        "capacity": 6
      },
      {
        "id": "۲۳۲۱۵",
        "name": "بازی‌های رایانه‌ای مصاحبه دارد - شرایط در پیوست شماره یک - فقط مرد روزانه",
        "universityId": "eisu",
        "universityName": "دانشگاه جامع انقلاب اسلامی - تهران",
        "rank": 7,
        "capacity": 5
      },
      {
        "id": "۲۳۲۲۷",
        "name": "مهندسی و علم کامپیوتر گرایش نرم افزار نوبت دوم",
        "universityId": "ut",
        "universityName": "دانشگاه تهران",
        "rank": 1,
        "capacity": 8
      },
      {
        "id": "۲۳۲۳۱",
        "name": "مهندسی و علم کامپیوتر گرایش نرم افزار عدم تعهد در واگذاری خوابگاه نوبت دوم",
        "universityId": "kntu",
        "universityName": "دانشگاه صنعتی خواجه نصیرالدین طوسی - تهران",
        "rank": 2,
        "capacity": 5
      },
      {
        "id": "۲۳۲۴۳",
        "name": "مهندسی و علم کامپیوتر گرایش الگوریتم‌ها و محاسبات محل تحصیل دانشکده علوم مهندسی پردیس دانشکده‌های فنی نوبت دوم",
        "universityId": "ut",
        "universityName": "دانشگاه تهران",
        "rank": 2,
        "capacity": 10
      }
    ]
  }

];
